#include <stdio.h>
int main()
{
    int a;
    char A[10][20] = {"ноль","один", "два","три","четыре","пять","шесть","семь","восемь","девять"};
    char B[9][30] = {"одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    char C[9][30] = {"десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят", "девяносто"};
    char D[10][20] = {"один", "два","три","четыре","пять","шесть","семь","восемь","девять"};
    printf("Введите число: ");
    scanf("%d", &a);
    if (a < 10)
    {
        printf("%s", A[a]);
    }
    else if (a>10 and a<20)
    {
        printf("%s", B[(a/10)-1]);
    }
    else if (a>20 or a==10)
    {
        printf("%s %s", C[(a/10)-1], D[(a%10)-1]);
    }
    else if (a%10==0)
    {
        printf("%s", C[(a/10)-1]);
    }
    return 0;
}
